Repository: adslbarxatov/VectorImageGenerator
Catalog: src/SVGGenerator_*.resx
Languages: ru_ru

# BExitText
source: E&xit
ru_ru: В&ыход

# GenerateImageText
source: &Generate
ru_ru: &Сформировать

# OFDialogFilter
source: Script files (*.sc)|*.sc|All files|*.*
ru_ru: Файлы сценариев (*.sc)|*.sc|Все файлы|*.*

# OFDialogTitle
source: Specify script file for image generation
ru_ru: Выберите сценарий для формирования изображения

# SaveSampleText
source: &Example...
ru_ru: &Образец...

# SFDialogFilter
source: SVG vector image files|*.svg|EMF vector image files|*.emf
ru_ru: Файлы векторных изображений SVG|*.svg|Файлы векторных изображений EMF|*.emf

# SFDialogTitle
source: Specify placement for new image
ru_ru: Укажите место для сохранения изображения

# SSDialogTitle
source: Specify placement for example script
ru_ru: Укажите место для сохранения образца сценария

# BrokenLineColor
source: wrong curve's color declaration at line {0:D}
ru_ru: ошибка описания цвета кривой в строке {0:D}

# BrokenLinePoint
source: wrong curve's point declaration at line {0:D}
ru_ru: ошибка описания точки кривой в строке {0:D}

# BrokenLineWidth
source: wrong curve's width declaration at line {0:D}
ru_ru: ошибка описания толщины кривой в строке {0:D}

# BrokenOxColor
source: wrong Ox axe's color declaration at line {0:D}
ru_ru: ошибка описания цвета оси Ox в строке {0:D}

# BrokenOxNotch
source: wrong Ox axe's notch declaration at line {0:D}
ru_ru: ошибка описания засечки на оси Ox в строке {0:D}

# BrokenOxOffset
source: wrong Ox axe's offset declaration at line {0:D}
ru_ru: ошибка описания смещения оси Ox в строке {0:D}

# BrokenOxWidth
source: wrong Ox axe's width declaration at line {0:D}
ru_ru: ошибка описания толщины оси Ox в строке {0:D}

# BrokenOyColor
source: wrong Oy axe's color declaration at line {0:D}
ru_ru: ошибка описания цвета оси Oy в строке {0:D}

# BrokenOyNotch
source: wrong Oy axe's notch declaration at line {0:D}
ru_ru: ошибка описания засечки на оси Oy в строке {0:D}

# BrokenOyOffset
source: wrong Oy axe's offset declaration at line {0:D}
ru_ru: ошибка описания смещения оси Oy в строке {0:D}

# BrokenOyWidth
source: wrong Oy axe's width declaration at line {0:D}
ru_ru: ошибка описания толщины оси Oy в строке {0:D}

# BrokenText
source: wrong text subscription's declaration at line {0:D}
ru_ru: ошибка описания текстовой подписи в строке {0:D}

# CannotCreateFile
source: cannot create file in specified directory
ru_ru: не удалось создать файл в указанном расположении

# CannotCreateSample
source: Cannot create example file. Probably, specified directory is not writable
ru_ru: Не удалось создать файл образца. Возможно, указанное расположение защищено от записи

# CannotCreateTMP
source: cannot create temporary file. Probably, placement of the script file is not writable
ru_ru: не удаётся создать вспомогательный файл. Возможно, расположение файла сценария недоступно для записи

# CannotIncludeFile
source: including file «{0:S}» not found, unavailable or declared with wrong parameters
ru_ru: подключаемый файл «{0:S}» не найден, недоступен, или параметры его подключения некорректны

# ExceptionMessage
source: Internal error occurred in application. Debug is required
ru_ru: В приложении произошла внутренняя ошибка. Требуется отладка

# FileCreated
source: Image file successfully created
ru_ru: Файл изображения успешно сформирован

# FileNotAvailable
source: script file not found or unavailable
ru_ru: файл сценария не найден или недоступен

# FileWritingError
source: Failed to create image file:
ru_ru: Ошибка записи файла изображения:

# IncludeDeepOverflow
source: maximum number of includings has been exceeded. There may be a circular reference
ru_ru: превышено максимально допустимое количество подключений. Возможно, присутствует циклическая ссылка

# IncorrectImageSize
source: data in the script file doesn't allow generation of 2D-image
ru_ru: данные в файле скрипта не позволяют сформировать двумерное изображение

# InputFileNotSpecified
source: No image script file specified
ru_ru: Не задан файл сценария для формирования изображения

# OutputFileNotSpecified
source: Image file's location not specified
ru_ru: Не задано расположение создаваемого изображения

# ScriptReadingError
source: Failed to read script file:
ru_ru: Ошибка чтения файла сценария:
